Server/ab_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ssdam.s3-website.ap-northeast-2.amazonaws.com (be patient).....done


Server Software:        AmazonS3
Server Hostname:        ssdam.s3-website.ap-northeast-2.amazonaws.com
Server Port:            80

Document Path:          /
Document Length:        782 bytes

Concurrency Level:      10
Time taken for tests:   0.272 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      113500 bytes
HTML transferred:       78200 bytes
Requests per second:    367.45 [#/sec] (mean)
Time per request:       27.215 [ms] (mean)
Time per request:       2.721 [ms] (mean, across all concurrent requests)
Transfer rate:          407.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.3      0       2
Processing:    13   21   7.6     19      45
Waiting:       13   21   7.6     19      45
Total:         14   22   7.7     19      46
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%     19
  66%     20
  75%     21
  80%     31
  90%     36
  95%     38
  98%     41
  99%     46
 100%     46 (longest request)